JayHeng/RT-MFB/devices/MIMXRT1189/drivers/fsl_i3c.c
/*
 * Copyright 2018-2022 NXP
 * All rights reserved.
 *
 * SPDX-License-Identifier: BSD-3-Clause
 */

#include "fsl_i3c.h"
#if !(defined(FSL_FEATURE_I3C_HAS_NO_RESET) && FSL_FEATURE_I3C_HAS_NO_RESET)
#include "fsl_reset.h"
#endif
#include <stdlib.h>
#include <string.h>

/*******************************************************************************
 * Definitions
 ******************************************************************************/

/* Component ID definition, used by tools. */
#ifndef FSL_COMPONENT_ID
#define FSL_COMPONENT_ID "platform.drivers.i3c"
#endif

#define I3C_BROADCASE_ADDR (0x7EU)

#define NSEC_PER_SEC            (1000000000UL)
#define FSL_I3C_ERROR_RATE_MAX  (10U)
#define FSL_I3C_PPBAUD_DIV_MAX  ((I3C_MCONFIG_PPBAUD_MASK >> I3C_MCONFIG_PPBAUD_SHIFT) + 1U)
#define FSL_I3C_ODBAUD_DIV_MAX  ((I3C_MCONFIG_ODBAUD_MASK >> I3C_MCONFIG_ODBAUD_SHIFT) + 1U)
#define FSL_I3C_I2CBAUD_DIV_MAX (((I3C_MCONFIG_I2CBAUD_MASK >> I3C_MCONFIG_I2CBAUD_SHIFT) + 1U) / 2U)

/*! @brief Common sets of flags used by the driver. */
enum _i3c_flag_constants
{
    /*! All flags which are cleared by the driver upon starting a transfer. */
    kMasterClearFlags = kI3C_MasterSlaveStartFlag | kI3C_MasterControlDoneFlag | kI3C_MasterCompleteFlag |
                        kI3C_MasterArbitrationWonFlag | kI3C_MasterSlave2MasterFlag | kI3C_MasterErrorFlag,

    /*! IRQ sources enabled by the non-blocking transactional API. */
    kMasterIrqFlags = kI3C_MasterSlaveStartFlag | kI3C_MasterControlDoneFlag | kI3C_MasterCompleteFlag |
                      kI3C_MasterRxReadyFlag /* | kI3C_MasterTxReadyFlag */ | kI3C_MasterArbitrationWonFlag |
                      kI3C_MasterErrorFlag | kI3C_MasterSlave2MasterFlag,

    /*! Errors to check for. */
    kMasterErrorFlags = kI3C_MasterErrorNackFlag | kI3C_MasterErrorWriteAbortFlag |
#if !defined(FSL_FEATURE_I3C_HAS_NO_MERRWARN_TERM) || (!FSL_FEATURE_I3C_HAS_NO_MERRWARN_TERM)
                        kI3C_MasterErrorTermFlag |
#endif
                        kI3C_MasterErrorParityFlag | kI3C_MasterErrorCrcFlag | kI3C_MasterErrorReadFlag |
                        kI3C_MasterErrorWriteFlag | kI3C_MasterErrorMsgFlag | kI3C_MasterErrorInvalidReqFlag |
                        kI3C_MasterErrorTimeoutFlag,
    /*! All flags which are cleared by the driver upon starting a transfer. */
    kSlaveClearFlags = kI3C_SlaveBusStartFlag | kI3C_SlaveMatchedFlag | kI3C_SlaveBusStopFlag,

    /*! IRQ sources enabled by the non-blocking transactional API. */
    kSlaveIrqFlags = kI3C_SlaveBusStartFlag | kI3C_SlaveMatchedFlag | kI3C_SlaveBusStopFlag | kI3C_SlaveRxReadyFlag |
                     kI3C_SlaveDynamicAddrChangedFlag | kI3C_SlaveReceivedCCCFlag | kI3C_SlaveErrorFlag |
                     kI3C_SlaveHDRCommandMatchFlag | kI3C_SlaveCCCHandledFlag | kI3C_SlaveEventSentFlag,

    /*! Errors to check for. */
    kSlaveErrorFlags = kI3C_SlaveErrorOverrunFlag | kI3C_SlaveErrorUnderrunFlag | kI3C_SlaveErrorUnderrunNakFlag |
                       kI3C_SlaveErrorTermFlag | kI3C_SlaveErrorInvalidStartFlag | kI3C_SlaveErrorSdrParityFlag |
                       kI3C_SlaveErrorHdrParityFlag | kI3C_SlaveErrorHdrCRCFlag | kI3C_SlaveErrorS0S1Flag |
                       kI3C_SlaveErrorOverreadFlag | kI3C_SlaveErrorOverwriteFlag,
};

/*! @brief States for the state machine used by transactional APIs. */
enum _i3c_transfer_states
{
    kIdleState = 0,
    kIBIWonState,
    kSlaveStartState,
    kSendCommandState,
    kWaitRepeatedStartCompleteState,
    kTransferDataState,
    kStopState,
    kWaitForCompletionState,
};

/*!
 * @brief Used for conversion between `uint8_t*` and `uint32_t`.
 */
typedef union i3c_puint8_to_u32
{
    uint8_t *puint8;
    uint32_t u32;
    const uint8_t *cpuint8;
} i3c_puint8_to_u32_t;

/*
 * <! Structure definition for variables that passed as parameters in I3C_RunTransferStateMachine.
 * The structure is private.
 */
typedef struct _i3c_state_machine_param
{
    bool state_complete;
    size_t txCount;
    size_t rxCount;
    uint32_t status;
    status_t result;
    i3c_master_state_t masterState;
} i3c_master_state_machine_param_t;

/*
 * <! Structure definition for variables that passed as parameters in I3C_SlaveTransferHandleIRQ.
 * The structure is private.
 */
typedef struct _i3c_transfer_handleIrq_param
{
    size_t txCount;
    size_t rxCount;
    uint32_t flags;
    uint32_t pendingInts;
    uint32_t enabledInts;
} i3c_slave_handleIrq_param_t;

/*******************************************************************************
 * Prototypes
 ******************************************************************************/

/* Not static so it can be used from fsl_i3c_dma.c. */
static status_t I3C_MasterWaitForTxReady(I3C_Type *base, uint8_t byteCounts);
/*******************************************************************************
 * Variables
 ******************************************************************************/

/*! @brief Array to map I3C instance number to base pointer. */
static I3C_Type *const kI3cBases[] = I3C_BASE_PTRS;

/*! @brief Array to map I3C instance number to IRQ number. */
IRQn_Type const kI3cIrqs[] = I3C_IRQS;

#if !(defined(FSL_SDK_DISABLE_DRIVER_CLOCK_CONTROL) && FSL_SDK_DISABLE_DRIVER_CLOCK_CONTROL)
/*! @brief Array to map I3C instance number to clock gate enum. */
static clock_ip_name_t const kI3cClocks[] = I3C_CLOCKS;
#endif /* FSL_SDK_DISABLE_DRIVER_CLOCK_CONTROL */

#if !(defined(FSL_FEATURE_I3C_HAS_NO_RESET) && FSL_FEATURE_I3C_HAS_NO_RESET)
/*! @brief Pointers to I3C resets for each instance. */
static const reset_ip_name_t kI3cResets[] = I3C_RSTS;
#endif

static i3c_device_info_t devList[I3C_MAX_DEVCNT]; /*!< I3C slave record list */
static uint8_t usedDevCount = 0;

/*! @brief Pointer to master IRQ handler for each instance. */
i3c_master_isr_t s_i3cMasterIsr;

/*! @brief Pointers to master handles for each instance. */
void *s_i3cMasterHandle[ARRAY_SIZE(kI3cBases)];

/*! @brief Pointer to slave IRQ handler for each instance. */
i3c_slave_isr_t s_i3cSlaveIsr;

/*! @brief Pointers to slave handles for each instance. */
void *s_i3cSlaveHandle[ARRAY_SIZE(kI3cBases)];

/*!
 * @brief introduce function I3C_TransferStateMachineIBIWonState.
 * This function was deal with init function I3C_RunTransferStateMachine`s variable.
 *
 * @param base The I3C peripheral base address.
 * @param handle handle Pointer to #i3c_slave_handle_t structure which stores the transfer state.
 * @param stateParams Pass the address of the parent function variable.
 */
static void I3C_TransferStateMachineIBIWonState(I3C_Type *base,
                                                i3c_master_handle_t *handle,
                                                i3c_master_state_machine_param_t *stateParams);

/*!
 * @brief introduce function static bool I3C_TransferStateMachineSendCommandState.
 * This function was deal with when state is stop.
 *
 * @param base The I3C peripheral base address.
 * @param handle handle Pointer to #i3c_slave_handle_t structure which stores the transfer state.
 * @param stateParams Pass the address of the parent function variable.
 */
static void I3C_TransferStateMachineSendCommandState(I3C_Type *base,
                                                     i3c_master_handle_t *handle,
                                                     i3c_master_state_machine_param_t *stateParams);

/*!
 * @brief introduce function I3C_TransferStateMachineWaitRepeatedStartCompleteState.
 * This function was deal with Wait Repeated Start Complete State.
 *
 * @param base The I3C peripheral base address.
 * @param handle handle Pointer to #i3c_slave_handle_t structure which stores the transfer state.
 * @param stateParams Pass the address of the parent function variable.
 */
static void I3C_TransferStateMachineWaitRepeatedStartCompleteState(I3C_Type *base,
                                                                   i3c_master_handle_t *handle,
                                                                   i3c_master_state_machine_param_t *stateParams);

/*!
 * @brief introduce function I3C_TransferStateMachineTransferDataState.
 * This function was deal with Transfer Data State.
 *
 * @param base The I3C peripheral base address.
 * @param handle handle Pointer to #i3c_slave_handle_t structure which stores the transfer state.
 * @param stateParams Pass the address of the parent function variable.
 */
static void I3C_TransferStateMachineTransferDataState(I3C_Type *base,
                                                      i3c_master_handle_t *handle,
                                                      i3c_master_state_machine_param_t *stateParams);
/*!
 * @brief introduce function I3C_TransferStateMachineWaitForCompletionState.
 * This function was deal with Wait For Completion State.
 *
 * @param handle handle Pointer to #i3c_slave_handle_t structure which stores the transfer state.
 * @param stateParams Pass the address of the parent function variable.
 */
static void I3C_TransferStateMachineWaitForCompletionState(i3c_master_handle_t *handle,
                                                           i3c_master_state_machine_param_t *stateParams);

/*!
 * @brief introduce function I3C_TransferStateMachineStopState.
 * This function was deal with Stop State.
 *
 * @param base The I3C peripheral base address.
 * @param stateParams Pass the address of the parent function variable.
 */
static void I3C_TransferStateMachineStopState(I3C_Type *base,
                                              i3c_master_handle_t *handle,
                                              i3c_master_state_machine_param_t *stateParams);

/*!
 * @brief introduce function I3C_SlaveTransferHandleGetStatusFlags.
 * This function was deal get status flag.
 *
 * @param base The I3C peripheral base address.
 * @param handle handle Pointer to #i3c_slave_handle_t structure which stores the transfer state.
 * @param stateParams Pass the address of the parent function variable.
 *
 * @return default true when No abnormality.
 * @return true when error.
 */
static bool I3C_SlaveTransferHandleGetStatusFlags(I3C_Type *base,
                                                  i3c_slave_handle_t *handle,
                                                  i3c_slave_handleIrq_param_t *stateParams);
/*!
 * @brief introduce function I3C_SlaveTransferHandleBusStart.
 * This function was deal start Bus.
 *
 * @param base The I3C peripheral base address.
 * @param xfer address to xfer.
 * @param pendingInts address to pendingInts.
 */
static void I3C_SlaveTransferHandleBusStart(I3C_Type *base, i3c_slave_transfer_t *xfer, uint32_t *pendingInts);

/*!
 * @brief introduce function I3C_SlaveTransferHandleEventSent.
 * This function was deal sent event.
 *
 * @param base The I3C peripheral base address.
 * @param handle handle Pointer to #i3c_slave_handle_t structure which stores the transfer state.
 * @param xfer address to xfer.
 */
static void I3C_SlaveTransferHandleEventSent(I3C_Type *base, i3c_slave_handle_t *handle, i3c_slave_transfer_t *xfer);

/*!
 * @brief introduce function I3C_SlaveTransferHandleReceivedCCC.
 * This function was deal Received.
 *
 * @param base The I3C peripheral base address.
 * @param handle handle Pointer to #i3c_slave_handle_t structure which stores the transfer state.
 * @param xfer address to xfer.
 */
static void I3C_SlaveTransferHandleReceivedCCC(I3C_Type *base, i3c_slave_handle_t *handle, i3c_slave_transfer_t *xfer);

/*!
 * @brief introduce function I3C_SlaveTransferHandleBusStop.
 * This function was deal stop Bus.
 *
 * @param base The I3C peripheral base address.
 * @param handle handle Pointer to #i3c_slave_handle_t structure which stores the transfer state.
 * @param stateParams Pass the address of the parent function variable.
 */
static void I3C_SlaveTransferHandleBusStop(I3C_Type *base,
                                           i3c_slave_handle_t *handle,
                                           i3c_slave_handleIrq_param_t *stateParams);

/*!
 * @brief introduce function I3C_SlaveTransferHandleMatched.
 * This function was deal matched.
 *
 * @param base The I3C peripheral base address.
 * @param handle handle Pointer to #i3c_slave_handle_t structure which stores the transfer state.
 * @param xfer address to xfer.
 */
static void I3C_SlaveTransferHandleMatched(I3C_Type *base, i3c_slave_handle_t *handle, i3c_slave_transfer_t *xfer);

/*!
 * @brief introduce function I3C_SlaveTransferHandleTxReady.
 * This function was deal when Tx was ready.
 *
 * @param base The I3C peripheral base address.
 * @param handle handle Pointer to #i3c_slave_handle_t structure which stores the transfer state.
 * @param stateParams Pass the address of the parent function variable.
 */
static void I3C_SlaveTransferHandleTxReady(I3C_Type *base,
                                           i3c_slave_handle_t *handle,
                                           i3c_slave_handleIrq_param_t *stateParams);

/*!
 * @brief introduce function I3C_SlaveTransferHandleRxReadyy.
 * This function was deal with when Rx was ready.
 *
 * @param base The I3C peripheral base address.
 * @param handle handle Pointer to #i3c_slave_handle_t structure which stores the transfer state.
 * @param stateParams Pass the address of the parent function variable.
 */
static void I3C_SlaveTransferHandleRxReady(I3C_Type *base,
                                           i3c_slave_handle_t *handle,
                                           i3c_slave_handleIrq_param_t *stateParams);

