JayHeng/RT-MFB/devices/MIMXRT1189/drivers/fsl_i3c.c
static void I3C_SlaveTransferHandleEventSent(I3C_Type *base, i3c_slave_handle_t *handle, i3c_slave_transfer_t *xfer)
{
    xfer->event = (uint32_t)kI3C_SlaveRequestSentEvent;
    if (handle->ibiData != NULL)
    {
        size_t count = 0U;
        while (count < handle->ibiDataSize)
        {
            base->SCTRL = (base->SCTRL & ~I3C_SCTRL_IBIDATA_MASK) | I3C_SCTRL_IBIDATA(handle->ibiData[count]) |
                          I3C_SCTRL_EVENT(1U);
            count++;
        }
    }

    /* Reset IBI data buffer. */
    handle->ibiData = NULL;

    if ((0UL != (handle->eventMask & xfer->event)) && (NULL != handle->callback))
    {
        handle->callback(base, xfer, handle->userData);
    }
}

static void I3C_SlaveTransferHandleReceivedCCC(I3C_Type *base, i3c_slave_handle_t *handle, i3c_slave_transfer_t *xfer)
{
    handle->isBusy = true;
    xfer->event    = (uint32_t)kI3C_SlaveReceivedCCCEvent;
    if ((0UL != (handle->eventMask & xfer->event)) && (NULL != handle->callback))
    {
        handle->callback(base, xfer, handle->userData);
    }
}

static void I3C_SlaveTransferHandleBusStop(I3C_Type *base,
                                           i3c_slave_handle_t *handle,
                                           i3c_slave_handleIrq_param_t *stateParams)
{
    assert(NULL != base && NULL != handle && NULL != stateParams);
    I3C_SlaveDisableInterrupts(base, (uint32_t)kI3C_SlaveTxReadyFlag);
    stateParams->pendingInts &= ~(uint32_t)kI3C_SlaveTxReadyFlag;
    base->SDATACTRL |= I3C_SDATACTRL_FLUSHTB_MASK | I3C_SDATACTRL_FLUSHFB_MASK;
    if (handle->isBusy == true)
    {
        handle->transfer.event            = (uint32_t)kI3C_SlaveCompletionEvent;
        handle->transfer.completionStatus = kStatus_Success;
        handle->transfer.transferredCount = handle->transferredCount;
        handle->isBusy                    = false;

        if (handle->wasTransmit)
        {
            /* Subtract one from the transmit count to offset the fact that I3C asserts the */
            /* tx flag before it sees the nack from the master-receiver, thus causing one more */
            /* count that the master actually receives. */
            --handle->transfer.transferredCount;
            handle->wasTransmit = false;
        }

        if ((0UL != (handle->eventMask & handle->transfer.event)) && (NULL != handle->callback))
        {
            handle->callback(base, &handle->transfer, handle->userData);
        }

        /* Clean up transfer info on completion, after the callback has been invoked. */
        (void)memset(&handle->transfer, 0, sizeof(handle->transfer));
    }
}

static void I3C_SlaveTransferHandleMatched(I3C_Type *base, i3c_slave_handle_t *handle, i3c_slave_transfer_t *xfer)
{
    assert(NULL != base && NULL != handle && NULL != xfer);
    xfer->event    = (uint32_t)kI3C_SlaveAddressMatchEvent;
    handle->isBusy = true;
    if ((0UL != (handle->eventMask & (uint32_t)kI3C_SlaveAddressMatchEvent)) && (NULL != handle->callback))
    {
        handle->callback(base, xfer, handle->userData);
    }
}

static void I3C_SlaveTransferHandleTxReady(I3C_Type *base,
                                           i3c_slave_handle_t *handle,
                                           i3c_slave_handleIrq_param_t *stateParams)
{
    assert(NULL != base && NULL != handle && NULL != stateParams);
    handle->wasTransmit = true;

    /* If we're out of data, invoke callback to get more. */
    if ((NULL == handle->transfer.txData) || (0UL == handle->transfer.txDataSize))
    {
        handle->transfer.event = (uint32_t)kI3C_SlaveTransmitEvent;
        if (0UL != (stateParams->flags & (uint32_t)kI3C_SlaveBusHDRModeFlag))
        {
            handle->transfer.event |= (uint32_t)kI3C_SlaveHDRCommandMatchEvent;
        }
        if (NULL != handle->callback)
        {
            handle->callback(base, &handle->transfer, handle->userData);
        }

        /* Clear the transferred count now that we have a new buffer. */
        handle->transferredCount = 0;
    }

    if ((NULL == handle->transfer.txData) || (0UL == handle->transfer.txDataSize))
    {
        I3C_SlaveDisableInterrupts(base, (uint32_t)kI3C_SlaveTxReadyFlag);
        (stateParams->pendingInts) &= ~(uint32_t)kI3C_SlaveTxReadyFlag;
    }

    /* Transmit a byte. */
    while ((handle->transfer.txDataSize != 0UL) && ((stateParams->txCount) != 0U))
    {
        if (handle->transfer.txDataSize > 1UL)
        {
            base->SWDATAB = *handle->transfer.txData++;
        }
        else
        {
            base->SWDATABE = *handle->transfer.txData++;
            I3C_SlaveDisableInterrupts(base, (uint32_t)kI3C_SlaveTxReadyFlag);
        }
        --(handle->transfer.txDataSize);
        ++(handle->transferredCount);
        (stateParams->txCount)--;
    }
}

static void I3C_SlaveTransferHandleRxReady(I3C_Type *base,
                                           i3c_slave_handle_t *handle,
                                           i3c_slave_handleIrq_param_t *stateParams)
{
    assert(NULL != base && NULL != handle && NULL != stateParams);
    /* If we're out of room in the buffer, invoke callback to get another. */
    if ((NULL == handle->transfer.rxData) || (0UL == handle->transfer.rxDataSize))
    {
        handle->transfer.event = (uint32_t)kI3C_SlaveReceiveEvent;
        if (0UL != (stateParams->flags & (uint32_t)kI3C_SlaveBusHDRModeFlag))
        {
            handle->transfer.event |= (uint32_t)kI3C_SlaveHDRCommandMatchEvent;
        }
        if (NULL != handle->callback)
        {
            handle->callback(base, &handle->transfer, handle->userData);
        }
        handle->transferredCount = 0;
    }
    /* Receive a byte. */
    while ((stateParams->rxCount != 0U) && ((handle->transfer.rxData != NULL) && (handle->transfer.rxDataSize != 0UL)))
    {
        *(handle->transfer.rxData++) = (uint8_t)base->SRDATAB;
        --(handle->transfer.rxDataSize);
        ++(handle->transferredCount);
        (stateParams->rxCount)--;
    }
}

/*!
 * brief Reusable routine to handle slave interrupts.
 * note This function does not need to be called unless you are reimplementing the
 *  non blocking API's interrupt handler routines to add special functionality.
 * param base The I3C peripheral base address.
 * param handle Pointer to #i3c_slave_handle_t structure which stores the transfer state.
 */
void I3C_SlaveTransferHandleIRQ(I3C_Type *base, void *intHandle)
{
    i3c_slave_handleIrq_param_t stateParams;

